---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FailedToSetParameters
source: html/cb20ef36-8bd8-fd09-845e-8ca57c24f001.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FailedToSetParameters Property

Failed to apply family parameters.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedToSetParameters { get; }
```